local title = {['Name']=1,['ForecastLV']=2,['OpenLV']=3,['IconPath']=4,['Msg']=5,['Details']=6,['ShowType']=7,['ModelType']=8,['ModelID']=9,['ModelDesc']=10,['ModelScale']=11,['ModelRotation']=12,['ModelOffset']=13}
local data = {
[1]={ '诺比',5,5,'Icon/Forecast/mengzai1_main_icon.png','5级获得','获得[诺比]\n物理输出机甲·诺比，她是多美联邦最常见的机甲之一，由于机萌的外形深受人们喜爱。',2,1,102,'5级获得',1.2,{x=0,y=-155,z=0},{x=0,y=0,z=0} },
[2]={ '军衔',8,8,'Icon/Forecast/junxian1_main_icon.png','8级开启','解锁[军衔]\n军衔作为一个联邦战士是非常重要的，高阶段的军衔能够全面增加战斗力，军衔的提升需要收集各种对应的勋章。',1,0,0,'',0,{x=0,y=0,z=0},{x=0,y=0,z=0} },
[3]={ '历练',10,10,'Icon/Forecast/lilian1_main_icon.png','10级开启','解锁[历练]\n一种能够让其快速成长的任务，称之为历练任务。它可以获得大量的劳尔晶体，绑银，还能获得强大的天眼机甲。',1,0,0,'',0,{x=0,y=0,z=0},{x=0,y=0,z=0} },
[4]={ '坐骑',14,14,'Icon/Forecast/qixing1_main_icon.png','14级获得','获得[坐骑]\n太阳城的坐骑一直是多美人最喜爱的配置之一，各类个性坐骑能够极大的增加行走的移动速度。',2,2,2,'14级获得',0.6,{x=0,y=-90,z=0},{x=0,y=-0.2,z=0} },
[5]={ '技能升级',15,15,'Icon/Forecast/jineng1_main_icon.png','15级开启','解锁[技能升级]\n技能的升级是每一个欧洛斯勇士的必备课程，技能的升级能够极大的增加战斗力。',1,0,0,'',0,{x=0,y=0,z=0},{x=0,y=0,z=0} },
[6]={ '风暴试炼',18,18,'Icon/Forecast/huodong1_main_icon.png','18级开启','解锁[风暴试炼]\n检验战士实力的挑战玩法，风暴试炼将不同职业的战士分开做排名分析，每日对于榜上有名的战士发放大量银币。',1,0,0,'',0,{x=0,y=0,z=0},{x=0,y=0,z=0} },
[7]={ '交易',22,22,'Icon/Forecast/jiaoyi1_main_icon.png','22级开启','解锁[交易]\n多美联邦太阳城作为欧洛斯星区最繁荣的地方，联邦提供了自由的摆摊系统和指定交易系统，可以自由设定价格。',1,0,0,'',0,{x=0,y=0,z=0},{x=0,y=0,z=0} },
[8]={ '完美项链',24,24,'Icon/Forecast/wanmeiwuqi1_main_icon.png','24级主线获得','获得[完美项链]\n装备是提升战斗力最有效的途径，装备的品质分为从低到高，优质，无暇，完美和传说。',1,0,0,'',0,{x=0,y=0,z=0},{x=0,y=0,z=0} },
}
return {data, title}
