local title = {['UpdateUrl']=1,['Tip']=2}
local data = {
['11']={ '','请前往oppo应用商店进行下载' },
['12']={ '','请前往vivo应用商店进行下载' },
['13']={ '','请前往华为应用商店进行下载' },
['14']={ '','请前往九游进行下载' },
['15']={ '','请前往应用宝进行下载' },
['16']={ '','请前往小米应用商店进行下载' },
['17']={ '','请前往360应用商店进行下载' },
['18']={ '','请前往百度应用商店进行下载' },
['19']={ '','请前往魅族应用商店进行下载' },
['20']={ '','请前往联想应用商店进行下载' },
['21']={ '','请前往酷派应用商店进行下载' },
['22']={ '','请前往金立应用商店进行下载' },
['25']={ '','请前往三星应用商店进行下载' },
['26']={ '','请前往4399进行下载' },
['27']={ '','请前往联想应用商店进行下载' },
['28']={ '','请前往今日头条进行下载' },
}
return {data, title}
