local title = {['MountID']=1,['ShowOrder']=2,['SetID']=3,['Name']=4,['DefaultID']=5,['Price']=6,['Desc']=7,['Color']=8,['Gift']=9,['MountSpeed']=10,['IsShowWeapon']=11,['IsTmp']=12}
local data = {
{ 1,1,1,'地狱男爵',1,{{1,2,1,2000},{2,2,1,6000},{3,2,1,12000}},'以地球人类“哈雷”为原型设计而成的金属战车。\n骑乘时移动速度增加40%',9,1,40,0,0 },
{ 2,2,2,'萌面骑士',2,{{1,2,1,2000},{2,2,1,6000},{3,2,1,12000}},'萌仔机甲经过变化改装后可以变化的形态。\n骑乘时移动速度增加40%',9,1,40,0,0 },
{ 3,3,3,'刀锋幻影',3,{{1,2,1,4000},{2,2,1,12000},{3,2,1,24000}},'经过改装后的刀锋机甲，如幻如影般的飞驰。\n骑乘时移动速度增加50%',9,1,50,0,0 },
{ 4,4,4,'毁灭之光',4,{{1,2,1,6000},{2,2,1,18000},{3,2,1,36000}},'拥有最强大的“雷神毁灭推进器”启动时速度达到极致。\n骑乘时移动速度增加60%',9,1,60,0,0 },
{ 5,5,5,'麒麟·荒雷',5,{{1,1,9601002,1},{2,1,9601004,1},{3,1,9601006,1}},'依据古老地球神话，运用最先进的金属生命科技造就的梦幻坐骑。\n骑乘时移动速度增加50%',9,1,50,1,0 },
{ 6,6,6,'凤凰·火云',6,{{3,2,1,100000}},'依据古老地球神话，运用最先进的金属生命科技造就的梦幻坐骑。\n骑乘时移动速度增加70%',9,1,70,1,0 },
{ 7,7,7,'星空滑板',7,{{1,2,1,2000},{2,2,1,6000},{3,2,1,12000}},'多美冒险爱好者喜爱的滑板坐骑。\n骑乘时移动速度增加40%',9,1,40,1,0 },
{ 8,8,8,'水晶月轮',8,{{1,1,1020100,1}},'月出皎兮,佼人僚兮。美轮美奂的水晶月轮，是对你的思念。\n骑乘时移动速度增加70%',9,0,70,0,0 },
{ 9,9,9,'壁垒380',9,{{1,2,1,10000},{2,2,1,25000},{3,2,1,50000}},'壁垒380为多美联邦为铁血军团特制的战斗坐骑。\n骑乘时移动速度增加60%',9,1,60,0,0 },
{ 10,10,10,'雷霆战车',10,{{1,2,1,6000},{2,2,1,18000},{3,2,1,36000}},'雷神海盗王奥丁和奥尔菲亚共同研究的而成的能够适应任何地形的雷霆战车。\n骑乘时移动速度增加60%',9,1,60,0,0 },
{ 12,11,12,'合金幽狼',12,{{1,2,1,4000},{2,2,1,12000},{3,2,1,24000}},'阿波菲斯天南十字军团的专属坐骑。\n骑乘时移动速度增加50%',9,1,50,1,0 },
{ 14,12,14,'浣熊气球',14,{{1,2,1,10000},{2,2,1,25000},{3,2,1,50000}},'地球联邦为了星际观光而发明的永动漂浮形坐骑。\n骑乘时移动速度增加60%',9,1,60,0,0 },
{ 20,0,20,'星空滑板-五一活动',20,{},'五一活动的滑板坐骑。\n骑乘时移动速度增加45%',9,1,60,1,1 },
{ 23,13,23,'凤凰·灼焰',23,{{1,1,9600132,1},{2,1,9600134,1},{3,1,9600136,1}},'顶级生命金属锻造淬以星体聚变级能量的凤凰坐骑。\n骑乘时移动速度增加70%',1,1,70,1,0 },
{ 24,14,24,'壁垒426',24,{{1,1,9600142,1},{2,1,9600144,1},{3,1,9600146,1}},'壁垒426为赛特将军为黑血精锐量身打造的全能坐骑。\n骑乘时移动速度增加60%',3,1,60,0,0 },
{ 25,15,25,'梵塔幽狼',25,{{1,1,9600152,1},{2,1,9600154,1},{3,1,9600156,1}},'天南十字军团吸收宇宙暗能淬染梵塔黑级护甲的幽狼坐骑。\n骑乘时移动速度增加50%',3,1,50,1,0 },
{ 26,16,26,'月轮·鹊桥',26,{{1,1,9600161,1},{2,1,9600162,1},{3,1,9600163,1}},'织女绣云锦，牛郎河西盼。鹊桥河间架，七夕终短暂。月轮·鹊桥，是心上人之间的感情依托。\n骑乘时移动速度增加70%',8,0,70,0,0 },
{ 27,17,27,'星空滑板·国庆',27,{{1,1,9600181,1},{2,1,9600182,1},{3,1,9600183,1}},'多美冒险爱好者喜爱的滑板坐骑，国庆专属。\n骑乘时移动速度增加50%',9,1,50,1,0 },
{ 28,0,28,'星空滑板·国庆',28,{},'多美冒险爱好者喜爱的滑板坐骑，国庆专属。\n骑乘时移动速度增加40%',9,1,60,1,1 },
{ 29,18,29,'凤凰·极寒',29,{{1,1,9600122,1},{2,1,9600124,1},{3,1,9600126,1}},'在极寒星核中使用顶级生命金属锻造的特制凤凰坐骑，只有在跨服星战中占领神王星的军团领袖才能获得该坐骑\n骑乘时移动速度增加70%',4,0,70,1,0 },
}
local mt = {__index = function (table,key)
    local temp = title[key]
    if temp then
        return table[temp]
    end
    return nil
end}
for k, v in pairs(data) do
    setmetatable(v, mt)
end
return {data=data, title=title}
